Revit 2026 API

# ImporterIFCUtils Class

---

A class that contains utilities needed to implement Revit's version of the IFC import client application.

SystemObject Autodesk.Revit.DB.IFCImporterIFCUtils

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ImporterIFCUtils
```
```vb
Public NotInheritable Class ImporterIFCUtils
```
```cpp
public ref class ImporterIFCUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ImporterIFCUtils = class end
```

The ImporterIFCUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateEmptyFamily | Creates an empty family of a given category. |
|  | GetLocalFileName | Get the local file name, including the path, corresponding to a linked IFC file. This will create a local copy of the IFC file if necessary. |
|  | UpdateDirectShapeCategory | Updates the category of a DirectShape. |

This class contains special API utilities needed to enable the implementation of the client application for IFC import. Some of these utilities will be needed temporarily while the code for IFC import is migrated into the export client. These temporary interfaces are likely to change in upcoming Revit releases.

#### Reference

Autodesk.Revit.DB.IFC Namespace